////#include<stdio.h>
////void main() {
////	/*题目：参加百米运动会，如果用时8秒以内就进入决赛，否则淘汰，
////	并且根据性别提示进入男子组还是女子组
////	
////	==分析==
////	1.定义一个变量保存时间 double time
////	2.定义一个变量保存性别 char gender
////	3.使用嵌套分支
////	*/
////	double time = 0.0;//用double类型变量时，需要用%lf来接收
////	char gender = ' ';
////	printf("请输入跑步成绩(s)");
////	scanf_s("%lf", &time);//一定要注意用%lf,而不是%f
////	//根据time判断是否进入决赛
////	if (time <= 8) 
////	{//8秒之内进决赛，判断性别
////		printf("请输入性别（m/f）：");
////		scanf_s("%c", &gender);//接收回车键
////		scanf_s("%c", &gender);//接收性别
////		if (gender == 'm') {
////			printf("欢迎来到男子组决赛");
////		}
////		else {
////			printf("欢迎来到女子组决赛");
////		}
////
////	}
////	else 
////	{
////		printf("您的成绩不能进入决赛");
////	}
////	getchar();//回车
////	getchar();//暂停
////}
//
////==例题2==
///*
//出票系统：根据淡旺季的月份和年龄打印票价
//4-10月份为旺季:
//	成人(18-60):60
//	儿童(<18):半价
//	老人(>60):三折
//	淡季:
//	成人：40
//	其他：20
//	*/
//
////==思路==
///*
//定义月份变量 int mon
//多分支结构，嵌套,逻辑运算
//定义年龄变量int age
//*/
//#include<stdio.h>
//void main() {
//	int mon = 0;
//	int age = 0;
//	printf("请输入月份\n");
//	scanf_s("%d", &mon);
//	printf("请输入年龄\n");
//	scanf_s("%d", &age);
//	if (mon >= 4 && mon <= 10) {
//		if (age >= 18 && age <= 60) { 
//			printf("您需要支付60元"); 
//		}else if(age < 18){
//			printf("你需要支付30元");
//		}
//		else if (age > 60) {
//			printf("您需要支付20元");
//			}
//	}
//	else {
//		if (age >= 18 && age <= 60) {
//			printf("您需要支付40元");
//		}
//		else {
//			printf("您需要支付20元");
//		}
//	}
//}