//#include<stdio.h>
//void main() {
//
//	//+=的案例，其它的类似
//	int c = 12;
//	c += 3;//等价于c=c+3
//	printf("c=%d", c);//c=15
//
//	//陷阱=====================================
//	int d = 10;
//	d = d + 1.7;
//	printf("d=%d", d);//d=11,因为10+1.7=11.7,但d为int型，所以要去掉小数部分
//	//==========================================================
//	
//
//
//	//有两个变量a和b，要求将其进行交换，最终打印结果
//	int a = 10;
//	int b = 20;
//	//思路是通过一个临时变量来实现a和b值的交换
//	int temp = a;//把a的值赋给temp
//	a = b;//把b的值付给a
//	b = temp;//把temp的值(最初的a)赋给b
//	printf("a=%d,b=%d", a, b);
//}
///*结果
//a=20,b=10
//*/