////==题目==
///*
//完成下面的表达式输出
//请输入一个整数:6
//0+6=6
//1+5=6
//2+4=6
//3+3=6
//4+2=6
//5+1=6
//6+0=6
//*/
//
////分析
////1.接收用户的输入 num
////2.使用for 循环来输出从0-num的各种组合方式
////3.使用先死后活的方式来编程和思考，假定num就是6，然后再用变量
//#include<stdio.h>
//void main() {
//	//先用笨方法找出规律，就是用输入的数减去自增循环的数
//	//int i = 0;
//	//for (i = 0; i <= 6; i++) {
//	//	printf("\n%d+%d=%d",i,6-i,6);
//	
//
//	//真正的解法
//	int num = 0;//定义变量num
//	int i = 0;//定义变量i
//	printf("请输入一个数字:");
//	scanf_s("%d", &num);//扫描输入的数字，赋值给num
//	for (i = 0; i <= num;i++) {//循环语句，让i在小于等于num的值的时候自增
//		printf("\n%d+%d=%d", i, num - i, num);//打印输出
//		
//	}
//	}
//
///*
//
//0+6=6
//1+5=6
//2+4=6
//3+3=6
//4+2=6
//5+1=6
//6+0=6
//*/