////打印空心金字塔
////思路
////先尝试打印半个金字塔
///*
//打印半个金字塔，第一行打印1个，第二行2个.....
//*/
//
//
////#include<stdio.h>
////void main() {
////	int i, j;
////	for (i = 1; i <= 8; i++) {
////		for (j = 1; j <= i; j++) {
////			printf("*");
////		}printf("\n");
////	}
////
////}
///*
//*
//**
//***
//****
//*****
//******
//*******
//********
//*/
//
////打印半成品金字塔，第一行1个*第二行3个*，第n行就是2n-1个*
////所以只需要改变内循环里的j<=i;改为j<2*i-1;
////#include<stdio.h>
////void main() {
////	int i,j;
////	for (i = 1; i <= 8 ; i++) {
////		for (j = 1; j <= 2*i-1; j++) {
////			printf("*");
////		}printf("\n");
////	}
////
////}
///*
//*                //第一行1个*       要想居中，那么需要8-1=7个空格
//***				//3个							需要 8-2 =6个
//*****			//5个								8-3=5个
//*******
//*********
//***********
//*************										
//*************** //2n-1个							总层数-i个
//*/
//
////打印空格，看上图
////#include<stdio.h>
////void main() {
////	int i,j,k;
////	for (i = 1; i <= 8 ; i++) {
////		//输出空格，空格数等于总层数减去i
////		for (k = 0; k <= 8 - i; k++) { 
////			printf(" ");
////		}
////		for (j = 1; j <= 2*i-1; j++) {
////		
////			printf("*");
////		}printf("\n");
////	}
////
////}
//
///*
//		*				//第一行不需要空心星号
//	   ***             //第二行需要
//	  *****
//	 *******
//	*********
//   ***********
//  *************
// ***************		//最后一行不需要星号
//*/
//
//#include<stdio.h>
//void main() {
//	int i, j, k;
//	for (i = 1; i <= 8; i++) {
//		//输出空格，空格数等于总层数减去i
//		for (k = 0; k <= 8 - i; k++) {
//			printf(" ");
//		}
//		for (j = 1; j <= 2 * i - 1; j++) {
//			if (j == 1 || j == 2 * i - 1||i==8) {
//				printf("*");
//			}
//			else {
//				printf(" ");
//			}
//		}printf("\n");
//	}
//
//}
//
///*
//		*
//	   * *
//	  *   *
//	 *     *
//	*       *
//   *         *
//  *           *
// ***************
//*/