//////continue语句用于结束本次循环，继续执行下一次循环（区别break:-->break是中止循环）
////#include<stdio.h>
////void main() {
////	int i = 1;
////	while (i <= 4) {
////		i++;
////		if (i == 3) {
////			continue;
////		}printf("i=%d", i);
////	}
////}
/////*
////i=2i=4i=5
////*/
//
////demo2
//#include<stdio.h>
//void main() {
//	int i, j;//定义变量
//	for (j = 0; j < 10; j++) {//初始化变量j，定义循环条件，定义变量迭代
//		for (i = 0; i < 10; i++) {//初始化变量i，定义循环条件，定义变量迭代
//			if (i == 2) {
//				continue;
//			}printf("i=%d\n", i);
//		}printf("========\n");
//	}
//}
///*
//i=0
//i=1
//i=3
//i=4
//i=5
//i=6
//i=7
//i=8
//i=9
//========
//i=0
//i=1
//i=3
//i=4
//i=5
//i=6
//i=7
//i=8
//i=9
//========
//i=0
//i=1
//i=3
//i=4
//i=5
//i=6
//i=7
//i=8
//i=9
//========
//i=0
//i=1
//i=3
//i=4
//i=5
//i=6
//i=7
//i=8
//i=9
//========
//i=0
//i=1
//i=3
//i=4
//i=5
//i=6
//i=7
//i=8
//i=9
//========
//i=0
//i=1
//i=3
//i=4
//i=5
//i=6
//i=7
//i=8
//i=9
//========
//i=0
//i=1
//i=3
//i=4
//i=5
//i=6
//i=7
//i=8
//i=9
//========
//i=0
//i=1
//i=3
//i=4
//i=5
//i=6
//i=7
//i=8
//i=9
//========
//i=0
//i=1
//i=3
//i=4
//i=5
//i=6
//i=7
//i=8
//i=9
//========
//i=0
//i=1
//i=3
//i=4
//i=5
//i=6
//i=7
//i=8
//i=9
//========
//*/